processor/src/web/web/WEB-INF/classes/META-INF/rnip/createCatalog.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"> <S:Header> <wsse:Security S:actor="http://smev.gosuslugi.ru/actors/smev" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"> <wsse:BinarySecurityToken EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="SenderCertificate"></wsse:BinarySecurityToken> </wsse:Security> </S:Header> <S:Body wsu:Id="body"><!-- Здесь идёт тело запроса--> <n1:UnifoTransferMsg xsi:schemaLocation="http://roskazna.ru/SmevUnifoService/UnifoTransferMsg.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:n1="http://roskazna.ru/SmevUnifoService/" xmlns:n5="http://www.altova.com/samplexml/other-namespace" xmlns:ns1="http://www.bssys.com/xsd/Catalog" xmlns:pirq="http://roskazna.ru/xsd/PGU_ImportRequest" xmlns:smev="http://smev.gosuslugi.ru/rev111111" xmlns:smev2="http://roskazna.ru/SmevUnifoService/" xmlns:unifo="http://rosrazna.ru/xsd/SmevUnifoService" xmlns:org="http://roskazna.ru/xsd/Organization" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"> <smev:Message> <smev:Sender> <smev:Code>ISPP</smev:Code> <smev:Name>ИС ПП</smev:Name> </smev:Sender> <smev:Recipient> <smev:Code>9500</smev:Code> <smev:Name>RNIP</smev:Name> </smev:Recipient> <smev:Originator> <smev:Code/> <smev:Name>String</smev:Name> </smev:Originator> <smev:TypeCode>GSRV</smev:TypeCode> <smev:Status>REQUEST</smev:Status> <smev:Date>%CURRENT_DATE_TIME%</smev:Date> <smev:ExchangeType>String</smev:ExchangeType> <smev:RequestIdRef>String</smev:RequestIdRef> <smev:OriginRequestIdRef>String</smev:OriginRequestIdRef> <smev:ServiceCode>String</smev:ServiceCode> <smev:CaseNumber>String</smev:CaseNumber> <smev:TestMsg>String</smev:TestMsg> </smev:Message> <smev:MessageData> <smev:AppData> <unifo:ImportData> <pirs:ImportRequest xmlns:n2="http://www.altova.com/samplexml/other-namespace" xmlns:pirs="http://roskazna.ru/xsd/PGU_ImportRequest"> <PostBlock> <ID>String</ID> <TimeStamp>%CURRENT_DATE_TIME%</TimeStamp> <SenderIdentifier>%CONTRAGENT_ID%</SenderIdentifier> </PostBlock> <Catalog> <ServiceCatalog name="Каталог услуг по ИС ПП" revisionDate="%CURRENT_DATE%" version="1.0"> <ns1:Service code="AAAAA%CONTRAGENT_ID%0000000001" desc="Услуги по оплате питания учеников в образовательных учреждениях" isActive="true" name="Услуга питания в ОУ"> <ns1:ServiceCategory code="OU00000002" name="Среднее образование"/> <ns1:PaymentParameters> <ns1:DescriptionSimpleParameter forPayment="true" forSearch="false" label="Код гос. услуги" name="SRV_CODE" readonly="true" required="true" visible="false"> <ns1:DefaultValue>AAAAA%CONTRAGENT_ID%0000000001</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter label="Номер договора" isId="1" name="PAYMENT_TO" required="true" visible="true" readonly="false" forSearch="true" forPayment="true"> <ns1:Regexp>^\d{6,15}$</ns1:Regexp> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter forPayment="true" forSearch="false" label="Идентификатор поставщика" name="PAYMENT" readonly="true" required="true" visible="false"> <ns1:DefaultValue>%CONTRAGENT_BMID%</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter name="STATUS" label="Статус плательщика" required="true" readonly="false" visible="false" forSearch="false" forPayment="true"> <ns1:DefaultValue>0</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter name="PAYMENTTYPE " label="Тип платежа" required="true" readonly="false" visible="false" forSearch="false" forPayment="true"> <ns1:DefaultValue>0</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter name="PURPOSE" label="Основание платежа" required="true" readonly="false" visible="false" forSearch="false" forPayment="true"> <ns1:DefaultValue>0</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter name="TAXPERIOD" label="Налоговый период" required="true" readonly="false" visible="false" forSearch="false" forPayment="true"> <ns1:DefaultValue>0</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter name="TAXDOCNUMBER" label="Показатель номера документа" required="true" readonly="false" visible="false" forSearch="false" forPayment="true"> <ns1:DefaultValue>0</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter name="TAXDOCDATE" label="Показатель даты документа" required="true" readonly="false" visible="false" forSearch="false" forPayment="true"> <ns1:DefaultValue>0</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter label="Код бюджетной классификации" name="KBK" required="true" visible="false" readonly="true" forPayment="true" forSearch="false"> <ns1:DefaultValue>%KBK%</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter forPayment="true" forSearch="false" label="Наименование получателя" name="Recipient" readonly="true" required="true" visible="true"> <ns1:DefaultValue>%CONTRAGENT_NAME%</ns1:DefaultValue> </ns1:DescriptionSimpleParameter> <ns1:DescriptionSimpleParameter forPayment="true" forSearch="false" label="Назначение платежа" name="Narrative" readonly="false" required="true" visible="true"> <ns1:DefaultValue>Оплата услуг питания в образовательном учреждении </ns1:DefaultValue> </ns1:DescriptionSimpleParameter> </ns1:PaymentParameters> <ns1:CurrenciesServices> <ns1:CurrencyCode>RUR</ns1:CurrencyCode> </ns1:CurrenciesServices> <org:Payee INN="%INN%" KPP="%KPP%" OGRN="%OGRN%" OKATO="%OKATO%" name="%CONTRAGENT_NAME%"> <Accounts> <Account kind="1"> <Account>%FINANCE_ACCOUNT%</Account> <Bank> <Name>%FINANCE_PROVIDER%</Name> <CorrespondentBankAccount>%KORR_FINANCE_ACCOUNT% </CorrespondentBankAccount> <BIK>%BIK%</BIK> </Bank> </Account> </Accounts> </org:Payee> <ns1:PaymentKind>1</ns1:PaymentKind> <ns1:MinAmount currency="RUR" exponent="2">1</ns1:MinAmount> <ns1:MaxAmount currency="RUR" exponent="2">2147483647</ns1:MaxAmount> <ns1:Commissions> <Comission> <Kind>4</Kind> <Percent>%COMISSION_PERCENTS%</Percent> <MinValue currency="RUR" exponent="2">1</MinValue> <MaxValue currency="RUR" exponent="2">2147483647</MaxValue> </Comission> </ns1:Commissions> </ns1:Service> </ServiceCatalog> </Catalog> </pirs:ImportRequest> </unifo:ImportData> </smev:AppData> </smev:MessageData> </n1:UnifoTransferMsg> <!-- --> </S:Body></S:Envelope>